Repository: robystar/collective.googleauthenticator
Catalog: src/collective/googleauthenticator/locales/*/LC_MESSAGES/collective.googleauthenticator.po
Languages: it

source: 1. Scan this QR code with the Google Authenticator app
it: 1. Scansiona il QR-code con Google Authenticator-app

source: 2. Enter the verification code to activate two-step verification
it: 2. Inserisci il codice di verifica per attivare l'autenticazione a 2 fattori

source: An email with instructions on resetting your bar-code is sent successfully.
it: E' stata inviata una mail con le istruzioni per il reset del codice.

source: Automatically generated
it: Generato auomaicamente

source: Confirm your login by entering the verification generated by the Google Authenticator app.
it: Abilita l'accesso inserendo il codice generato dalla app Google Authenticator.

source: Enable two-step verification.
it: Abilita l'autenticazione a 2 fattori.

source: Enable/disable the two-step verification. Click <a href="@@setup-two-factor-authentication"> here</a> to set it up or <a href="@@disable-two-factor-authentication">here</a> to disable it.
it: Abilita/disabilita l'autenticazione a 2 fattori. Clicca <a href="@@setup-two-factor-authentication"> qui </a> per abilitare <a href="@@disable-two-factor-authentication"> qui </a> per disabilitare.

source: Enter code
it: Inserisci il codice

source: Enter the verification code generated by your mobile application.
it: Inserisci il codice generato con la app su mobile.

source: Enter the verification code generated by your mobile application. If you have somehow lost your bar code, request a bar code reset <a href="{0}/@@request-bar-code-reset">here</a>.
it: Inserisci il codice di verifica generato dalla applicazione. In caso di smarrimento puoi richiedere il reset del codice <a href="{0}/@@request-bar-code-reset">qui</a>..

source: Enter your secret key for the site here. When choosing a secret key, think of it as some sort of a password.
it: Inserisci qui la chiave segreta per il sito.

source: Enter your username for verification. The link code to reset the bar code would be sent to your email.
it: Inserisci il tuo nome utente per la verifica. Il link per il reset del codice ti verra' notificato via email.

source: Great! You're logged in.
it: Sei stato autenticato.

source: Invalid bar-code reset token
it: Codice non valido, reset token

source: Invalid bar-code reset token.
it: Codice non valido, reset token.

source: Invalid data. Details: {0}
it: Dati non validi. Dettagli: {0}

source: Invalid token or token expired.
it: Token non valido o scaduto.

source: Invalid username.
it: Nome utente non valido.

source: Request for bar-code reset is failed! {0}
it: Richiesta fallita per il bar-code! {0}

source: Request to reset the Google Authenticator bar code
it: Richiesta di reset del barcode per Google Authenticator

source: Request to reset the Google Authenticator bar-code
it: Richiesta di reset del barcode per Google Authenticator

source: Reset your two-step verification bar-code
it: Reset del tuo bar-code

source: Resetting of the bar-code failed! {0}
it: Reset del bar-code fallito! {0}

source: Secret Key
it: Chiave segreta

source: Secret key
it: Chiave segreta

source: Setup two-step verification
it: Setup verifica doppio fattore

source: Setup failed! {0}
it: Setup fallito! {0}

source: The Google Authenticator app generates a verification code, enter the code below
it: The Google Authenticator app ganera il codice di verifica, inserisci qui sotto il codice

source: To reset the two-step verification bar-code you need to install the GoogleAuthenticator app on your phone. This app is available for Android, iOS and BlackBerry devices.
it: Per resettare il codice di verifica occorre installare GoogleAuthenticator sul tuo dispositivo. questa applicazione è disponibile per Android, iOS and BlackBerry.

source: To setup two-step verification you need to install the GoogleAuthenticator app on your phone. This app is available for Android, iOS and BlackBerry devices.
it: Per impostare il codice di verifica occorre installare GoogleAuthenticator sul tuo dispositivo. questa applicazione è disponibile per Android, iOS and BlackBerry.

source: Token to reset the bar code
it: Token per resettare il bar-code

source: Two-step verification
it: Autenticazione a 2 fattori

source: Two-step verification bar-code is successfully reset for your account.
it: Il codice di verifica dell'autenticazione a doppio fattore è stato correttamente resettato per il tuo account.

source: Two-step verification is successfully enabled for your account.
it: Il codice di verifica dell'autenticazione a doppio fattore è stato abilitato per il tuo account.

source: User not found {0}.
it: Utente non trovato {0}.

source: Username
it: Nome utente

source: Verify
it: Verifica

source: Submit
it: Invia

source: You have successfully disabled the two-step verification for your account.
it: Hai disabilitato con successo l'autenticazione a doppio fattore.
